MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_Display/DispTFT5.0/Arhiv/FlyRf_Disp_26_07_19_00/GL050001C0_40_Display.cpp
  for (uint8_t index = 0; index < displayState.targetCount; ++index) {
    const GL050001C0_40_Target &target = displayState.targets[index];
    const uint32_t maxVisibleMeters = (uint32_t)rangeMeters * 2U;
    if (target.distanceM == 0 || target.distanceM > maxVisibleMeters) {
      continue;
    }
    const float relativeAngle = ((int)target.bearingDeg - (int)displayState.courseDeg) * DEG_TO_RAD_LOCAL;
    float radius;
    if (target.distanceM <= rangeMeters) {
      radius = ((float)target.distanceM * 180.0f) / rangeMeters;
    } else {
      radius = 180.0f + ((float)(target.distanceM - rangeMeters) *
                         (targetRadius - 180.0f)) / rangeMeters;
    }
    const int x = centerX + (int)lroundf(sinf(relativeAngle) * radius);
    const int y = centerY - (int)lroundf(cosf(relativeAngle) * radius);
    // Таблица занимает верхнюю часть экрана. Цели, попавшие за её границу,
    // не рисуем поверх заголовков и не включаем в частичную радарную область.
    if (y < 130) {
      continue;
    }
    const uint16_t color = targetColor(target.alarmLevel);
    fillCircle(x, y, 5, color);
    const float courseAngle = ((int)target.courseDeg - (int)displayState.courseDeg) * DEG_TO_RAD_LOCAL;
    drawLine(x, y, x + (int)lroundf(sinf(courseAngle) * 15),
             y - (int)lroundf(cosf(courseAngle) * 15), color);
    char label[20];
    snprintf(label, sizeof(label), "%+d", (int)target.relativeAltitudeM);
    drawSmoothString(x + 8, y - 7, label, color, FONT_SMALL);
  }
}

static void drawStatusBlocks()
{
  char buffer[48];
  if (displayState.showLoraStatus) {
    snprintf(buffer, sizeof(buffer), "LoRa Tx %lu", (unsigned long)displayState.loraTxPackets);
    drawSmoothString(8, 412, buffer, COLOR_STATUS_TEXT, FONT_TINY);
    snprintf(buffer, sizeof(buffer), "LoRa Rx %lu", (unsigned long)displayState.loraRxPackets);
    drawSmoothString(8, 433, buffer, COLOR_STATUS_TEXT, FONT_TINY);
    if (displayState.loraRfHz != 0) {
      snprintf(buffer, sizeof(buffer), "LoRa RF %.3f", displayState.loraRfHz / 1000000.0f);
    } else {
      snprintf(buffer, sizeof(buffer), "LoRa RF ---");
    }
    drawSmoothString(8, 454, buffer, COLOR_STATUS_TEXT, FONT_TINY);
    if (displayState.loraRssiDb < 0) {
      snprintf(buffer, sizeof(buffer), "LoRa RSSI %d dB", (int)displayState.loraRssiDb);
    } else {
      snprintf(buffer, sizeof(buffer), "LoRa RSSI ---");
    }
    drawSmoothString(8, 475, buffer, COLOR_STATUS_TEXT, FONT_TINY);
  }

  if (displayState.showGpsStatus) {
    snprintf(buffer, sizeof(buffer), "GPS Sat %u", (unsigned)displayState.satellites);
    drawSmoothString(615, 433, buffer, COLOR_STATUS_TEXT, FONT_TINY);
    if (displayState.gnssValid) {
      snprintf(buffer, sizeof(buffer), "GPS Lat %.5f", displayState.latitude);
      drawSmoothString(615, 454, buffer, COLOR_STATUS_TEXT, FONT_TINY);
      snprintf(buffer, sizeof(buffer), "GPS Lon %.5f", displayState.longitude);
      drawSmoothString(615, 475, buffer, COLOR_STATUS_TEXT, FONT_TINY);
    } else {
      drawSmoothString(615, 454, "GPS Lat ---", COLOR_STATUS_TEXT, FONT_TINY);
      drawSmoothString(615, 475, "GPS Lon ---", COLOR_STATUS_TEXT, FONT_TINY);
    }
  }
}

static void drawTopBar()
{
  char buffer[48];
  if (displayState.timeValid) {
    snprintf(buffer, sizeof(buffer), "%02u:%02u", (unsigned)displayState.hour, (unsigned)displayState.minute);
  } else {
    snprintf(buffer, sizeof(buffer), "--:--");
  }
  drawSmoothString(8, 32, buffer, COLOR_TEXT, FONT_LARGE);

  if (displayState.showPowerVoltage || displayState.showPowerCurrent) {
    if (displayState.powerValid) {
      if (displayState.showPowerVoltage && displayState.showPowerCurrent) {
        snprintf(buffer, sizeof(buffer), "%.2f V  %.0f mA",
                 displayState.voltageV, displayState.currentMa);
      } else if (displayState.showPowerVoltage) {
        snprintf(buffer, sizeof(buffer), "%.2f V", displayState.voltageV);
      } else {
        snprintf(buffer, sizeof(buffer), "%.0f mA", displayState.currentMa);
      }
    } else {
      snprintf(buffer, sizeof(buffer), "POWER ---");
    }
    drawSmoothString(540, 27, buffer, COLOR_TEXT, FONT_SMALL);
  }
  if (displayState.showPowerBattery) {
    drawBatteryIcon(690, 8, displayState.batteryPercent, displayState.powerValid);
    if (displayState.powerValid) {
      snprintf(buffer, sizeof(buffer), "%u%%", (unsigned)displayState.batteryPercent);
    } else {
      snprintf(buffer, sizeof(buffer), "---");
    }
    drawSmoothString(747, 27, buffer, COLOR_TEXT, FONT_SMALL);
  }
}

static void drawOperationalFrame()
{
  fillRect(0, 0, LCD_WIDTH, LCD_HEIGHT, COLOR_SCREEN_BG);
  drawRadar();
  drawStatusBlocks();
  drawTopBar();
  drawTargetTable();

  if (!displayState.baseConnected) {
    drawSmoothStringCentered(400, 245, "НЕТ СВЯЗИ С БАЗОЙ", COLOR_RED, FONT_LARGE);
  }

  if (displayState.sosActive) {
    fillRect(300, 275, 200, 78, COLOR_SCREEN_BG);
    drawRectOutline(300, 275, 200, 78, COLOR_WARN);
    drawSmoothStringCentered(400, 329, "SOS", COLOR_WARN, FONT_MEDIUM);
  }
}

static void drawOperationalOverlays()
{

  if (!displayState.baseConnected) {
    drawSmoothStringCentered(400, 245, "НЕТ СВЯЗИ С БАЗОЙ", COLOR_RED, FONT_LARGE);
  }

  if (displayState.sosActive) {
    fillRect(300, 275, 200, 78, COLOR_SCREEN_BG);
    drawRectOutline(300, 275, 200, 78, COLOR_WARN);
    drawSmoothStringCentered(400, 329, "SOS", COLOR_WARN, FONT_MEDIUM);
  }
}

static bool IRAM_ATTR onRgbVsync(esp_lcd_panel_handle_t panelHandle,
                                const esp_lcd_rgb_panel_event_data_t *eventData,
                                void *userContext)
{
  (void)panelHandle;
  (void)eventData;
  (void)userContext;
  BaseType_t taskWoken = pdFALSE;
  if (vsyncSemaphore != NULL) {
    xSemaphoreGiveFromISR(vsyncSemaphore, &taskWoken);
  }
  return taskWoken == pdTRUE;
}

static void waitForVsync()
{
  if (vsyncSemaphore == NULL) {
    return;
  }
  xSemaphoreTake(vsyncSemaphore, 0);
  xSemaphoreTake(vsyncSemaphore, pdMS_TO_TICKS(100));
}

static void flushBand(int y, int height)
{
  if (!ready || panel == NULL || frameBuffer == NULL || height <= 0) {
    return;
  }
  if (y < 0) {
    height += y;
    y = 0;
  }
  if (y + height > LCD_HEIGHT) {
    height = LCD_HEIGHT - y;
  }
  if (height <= 0) {
    return;
  }

  waitForVsync();
  esp_lcd_panel_draw_bitmap(panel, 0, y, LCD_WIDTH, y + height,
                            frameBuffer + y * LCD_WIDTH);
}

