MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_Display/DispTFT5.0/Arhiv/FlyRf_Disp_26_07_19_00/GL050001C0_40_Display.cpp
static void flushFrame()
{
  flushBand(0, LCD_HEIGHT);
}

static const uint8_t *glyphFor(char c)
{
  static const uint8_t space[7] = {0, 0, 0, 0, 0, 0, 0};
  static const uint8_t dash[7] = {0, 0, 0, 0x1F, 0, 0, 0};
  static const uint8_t colon[7] = {0, 0x04, 0x04, 0, 0x04, 0x04, 0};
  static const uint8_t dot[7] = {0, 0, 0, 0, 0, 0x0C, 0x0C};
  static const uint8_t underscore[7] = {0, 0, 0, 0, 0, 0, 0x1F};
  static const uint8_t leftParen[7] = {0x02, 0x04, 0x08, 0x08, 0x08, 0x04, 0x02};
  static const uint8_t rightParen[7] = {0x08, 0x04, 0x02, 0x02, 0x02, 0x04, 0x08};
  static const uint8_t zero[7] = {0x0E, 0x11, 0x13, 0x15, 0x19, 0x11, 0x0E};
  static const uint8_t one[7] = {0x04, 0x0C, 0x04, 0x04, 0x04, 0x04, 0x0E};
  static const uint8_t two[7] = {0x0E, 0x11, 0x01, 0x02, 0x04, 0x08, 0x1F};
  static const uint8_t three[7] = {0x1E, 0x01, 0x01, 0x0E, 0x01, 0x01, 0x1E};
  static const uint8_t four[7] = {0x02, 0x06, 0x0A, 0x12, 0x1F, 0x02, 0x02};
  static const uint8_t five[7] = {0x1F, 0x10, 0x10, 0x1E, 0x01, 0x01, 0x1E};
  static const uint8_t six[7] = {0x0E, 0x10, 0x10, 0x1E, 0x11, 0x11, 0x0E};
  static const uint8_t seven[7] = {0x1F, 0x01, 0x02, 0x04, 0x08, 0x08, 0x08};
  static const uint8_t eight[7] = {0x0E, 0x11, 0x11, 0x0E, 0x11, 0x11, 0x0E};
  static const uint8_t nine[7] = {0x0E, 0x11, 0x11, 0x0F, 0x01, 0x01, 0x0E};
  static const uint8_t letters[26][7] = {
    {0x0E, 0x11, 0x11, 0x1F, 0x11, 0x11, 0x11},
    {0x1E, 0x11, 0x11, 0x1E, 0x11, 0x11, 0x1E},
    {0x0E, 0x11, 0x10, 0x10, 0x10, 0x11, 0x0E},
    {0x1E, 0x11, 0x11, 0x11, 0x11, 0x11, 0x1E},
    {0x1F, 0x10, 0x10, 0x1E, 0x10, 0x10, 0x1F},
    {0x1F, 0x10, 0x10, 0x1E, 0x10, 0x10, 0x10},
    {0x0E, 0x11, 0x10, 0x17, 0x11, 0x11, 0x0F},
    {0x11, 0x11, 0x11, 0x1F, 0x11, 0x11, 0x11},
    {0x0E, 0x04, 0x04, 0x04, 0x04, 0x04, 0x0E},
    {0x01, 0x01, 0x01, 0x01, 0x11, 0x11, 0x0E},
    {0x11, 0x12, 0x14, 0x18, 0x14, 0x12, 0x11},
    {0x10, 0x10, 0x10, 0x10, 0x10, 0x10, 0x1F},
    {0x11, 0x1B, 0x15, 0x15, 0x11, 0x11, 0x11},
    {0x11, 0x19, 0x15, 0x13, 0x11, 0x11, 0x11},
    {0x0E, 0x11, 0x11, 0x11, 0x11, 0x11, 0x0E},
    {0x1E, 0x11, 0x11, 0x1E, 0x10, 0x10, 0x10},
    {0x0E, 0x11, 0x11, 0x11, 0x15, 0x12, 0x0D},
    {0x1E, 0x11, 0x11, 0x1E, 0x14, 0x12, 0x11},
    {0x0F, 0x10, 0x10, 0x0E, 0x01, 0x01, 0x1E},
    {0x1F, 0x04, 0x04, 0x04, 0x04, 0x04, 0x04},
    {0x11, 0x11, 0x11, 0x11, 0x11, 0x11, 0x0E},
    {0x11, 0x11, 0x11, 0x11, 0x0A, 0x0A, 0x04},
    {0x11, 0x11, 0x11, 0x15, 0x15, 0x1B, 0x11},
    {0x11, 0x11, 0x0A, 0x04, 0x0A, 0x11, 0x11},
    {0x11, 0x11, 0x0A, 0x04, 0x04, 0x04, 0x04},
    {0x1F, 0x01, 0x02, 0x04, 0x08, 0x10, 0x1F}
  };

  if (c >= 'a' && c <= 'z') {
    c -= 32;
  }
  if (c >= 'A' && c <= 'Z') {
    return letters[c - 'A'];
  }
  switch (c) {
    case '0': return zero;
    case '1': return one;
    case '2': return two;
    case '3': return three;
    case '4': return four;
    case '5': return five;
    case '6': return six;
    case '7': return seven;
    case '8': return eight;
    case '9': return nine;
    case '-': return dash;
    case ':': return colon;
    case '.': return dot;
    case '_': return underscore;
    case '(': return leftParen;
    case ')': return rightParen;
    default: return space;
  }
}

static void drawChar(int x, int y, char c, uint16_t color, int scale)
{
  const uint8_t *glyph = glyphFor(c);
  for (int row = 0; row < 7; ++row) {
    for (int col = 0; col < 5; ++col) {
      if (glyph[row] & (1 << (4 - col))) {
        fillRect(x + col * scale, y + row * scale, scale, scale, color);
      }
    }
  }
}

static void drawText(int x, int y, const String &text, uint16_t color, int scale)
{
  int cursor = x;
  for (size_t i = 0; i < text.length(); ++i) {
    drawChar(cursor, y, text[i], color, scale);
    cursor += 6 * scale;
  }
}

static int textWidth(const String &text, int scale)
{
  if (text.length() == 0) {
    return 0;
  }
  return (int)text.length() * 6 * scale - scale;
}

static void drawTextCentered(int y, const String &text, uint16_t color, int scale)
{
  drawText((LCD_WIDTH - textWidth(text, scale)) / 2, y, text, color, scale);
}

enum CyrillicGlyph {
  CYR_A,
  CYR_V,
  CYR_D,
  CYR_E,
  CYR_ZH,
  CYR_I,
  CYR_SHORT_I,
  CYR_K,
  CYR_L,
  CYR_O,
  CYR_S,
  CYR_T,
  CYR_CH,
  CYR_YU,
  CYR_YA
};

static const uint8_t CYRILLIC_GLYPHS[][7] = {
  {0x0E, 0x11, 0x11, 0x1F, 0x11, 0x11, 0x11}, // A
  {0x1E, 0x11, 0x11, 0x1E, 0x11, 0x11, 0x1E}, // V
  {0x0E, 0x0A, 0x0A, 0x12, 0x12, 0x1F, 0x11}, // D
  {0x1F, 0x10, 0x10, 0x1E, 0x10, 0x10, 0x1F}, // E
  {0x15, 0x15, 0x0E, 0x04, 0x0E, 0x15, 0x15}, // ZH
  {0x11, 0x11, 0x13, 0x15, 0x19, 0x11, 0x11}, // I
  {0x0A, 0x04, 0x11, 0x13, 0x15, 0x19, 0x11}, // SHORT I
  {0x11, 0x12, 0x14, 0x18, 0x14, 0x12, 0x11}, // K
  {0x03, 0x05, 0x09, 0x11, 0x11, 0x11, 0x11}, // L
  {0x0E, 0x11, 0x11, 0x11, 0x11, 0x11, 0x0E}, // O
  {0x0E, 0x11, 0x10, 0x10, 0x10, 0x11, 0x0E}, // S
  {0x1F, 0x04, 0x04, 0x04, 0x04, 0x04, 0x04}, // T
  {0x11, 0x11, 0x11, 0x0F, 0x01, 0x01, 0x01}, // CH
  {0x12, 0x15, 0x15, 0x1D, 0x15, 0x15, 0x12}, // YU
  {0x0F, 0x11, 0x11, 0x0F, 0x05, 0x09, 0x11}  // YA
};

static void drawCyrillicChar(int x, int y, CyrillicGlyph glyphIndex,
                             uint16_t color, int scale, bool italic)
{
  const uint8_t *glyph = CYRILLIC_GLYPHS[glyphIndex];
  for (int row = 0; row < 7; ++row) {
    const int italicOffset = italic ? (6 - row) * scale / 3 : 0;
    for (int col = 0; col < 5; ++col) {
      if (glyph[row] & (1 << (4 - col))) {
        fillRect(x + italicOffset + col * scale, y + row * scale,
                 scale, scale, color);
      }
    }
  }
}

static void drawCyrillicWordCentered(int y, const CyrillicGlyph *word,
                                     size_t length, uint16_t color, int scale)
{
  const int glyphStep = 7 * scale;
  const int width = (int)length * glyphStep - 2 * scale;
  int x = (LCD_WIDTH - width) / 2;
  for (size_t i = 0; i < length; ++i) {
    drawCyrillicChar(x, y, word[i], color, scale, true);
    x += glyphStep;
  }
}

static void drawShell()
{
  drawStartupBackground();
  drawSmoothStartupText();
  if (startupVersion.length() > 0) {
    const int width = smoothTextWidth(startupVersion.c_str(), FONT_TINY);
    drawSmoothString(778 - width, 468, startupVersion.c_str(),
                     COLOR_TEXT, FONT_TINY);
  }
  shellDrawn = true;
}

static void ensureShell()
{
  if (!shellDrawn) {
    drawShell();
  }
}

static bool topBarChanged(const GL050001C0_40_State &a,
                          const GL050001C0_40_State &b)
{
  return a.timeValid != b.timeValid || a.hour != b.hour || a.minute != b.minute ||
         a.powerValid != b.powerValid || a.batteryPercent != b.batteryPercent ||
         a.voltageV != b.voltageV || a.currentMa != b.currentMa ||
         a.showPowerVoltage != b.showPowerVoltage ||
         a.showPowerCurrent != b.showPowerCurrent ||
         a.showPowerBattery != b.showPowerBattery;
}

static bool targetTableChanged(const GL050001C0_40_State &a,
                               const GL050001C0_40_State &b)
{
  if (a.targetCount != b.targetCount) {
    return true;
  }
  for (uint8_t index = 0; index < a.targetCount; ++index) {
    const GL050001C0_40_Target &x = a.targets[index];
    const GL050001C0_40_Target &y = b.targets[index];
    if (x.address != y.address || strcmp(x.callsign, y.callsign) != 0 ||
        x.squawk != y.squawk || x.altitudeM != y.altitudeM ||
        x.speedKmh != y.speedKmh || x.courseDeg != y.courseDeg ||
        x.latitude != y.latitude || x.longitude != y.longitude ||
        x.signalRssi != y.signalRssi) {
      return true;
    }
  }
  return false;
}

static bool radarChanged(const GL050001C0_40_State &a,
                         const GL050001C0_40_State &b)
{
  if (a.baseConnected != b.baseConnected || a.sosActive != b.sosActive ||
      a.courseDeg != b.courseDeg || a.radarRangeM != b.radarRangeM ||
      a.targetCount != b.targetCount) {
    return true;
  }
  for (uint8_t index = 0; index < a.targetCount; ++index) {
    const GL050001C0_40_Target &x = a.targets[index];
    const GL050001C0_40_Target &y = b.targets[index];
    if (x.distanceM != y.distanceM || x.bearingDeg != y.bearingDeg ||
        x.courseDeg != y.courseDeg ||
        x.relativeAltitudeM != y.relativeAltitudeM ||
        x.alarmLevel != y.alarmLevel) {
      return true;
    }
  }
  return false;
}

static bool statusBlocksChanged(const GL050001C0_40_State &a,
                                const GL050001C0_40_State &b)
{
  return a.gnssValid != b.gnssValid || a.satellites != b.satellites ||
         a.latitude != b.latitude || a.longitude != b.longitude ||
         a.showLoraStatus != b.showLoraStatus ||
         a.showGpsStatus != b.showGpsStatus ||
         a.loraTxPackets != b.loraTxPackets ||
         a.loraRxPackets != b.loraRxPackets ||
         a.loraRfHz != b.loraRfHz || a.loraRssiDb != b.loraRssiDb;
}

bool GL050001C0_40_setup()
{
#if !GL050001C0_40_PINMAP_CONFIRMED
  Serial.println(F("[GL050001C0-40] RGB panel is disabled: not enough free GPIOs in the current FlyRF pinout."));
  Serial.println(F("[GL050001C0-40] Move peripherals first, then set GL050001C0_40_PINMAP_CONFIRMED=1 and fill the pin map."));
  return false;
#else
  esp_lcd_rgb_panel_config_t config = {};
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
  config.clk_src = LCD_CLK_SRC_PLL160M;
#endif
  config.data_width = 16;
  config.psram_trans_align = 64;
  config.sram_trans_align = 4;
  config.disp_gpio_num = LCD_PIN_DISP_EN;
  config.pclk_gpio_num = LCD_PIN_PCLK;
  config.vsync_gpio_num = LCD_PIN_VSYNC;
  config.hsync_gpio_num = LCD_PIN_HSYNC;
  config.de_gpio_num = LCD_PIN_DE;
  for (int i = 0; i < 16; ++i) {
    config.data_gpio_nums[i] = LCD_PIN_DATA[i];
  }
  // Снижение PCLK уменьшает нагрузку RGB DMA на PSRAM при работе Wi-Fi.
  config.timings.pclk_hz = 24000000;
  config.timings.h_res = LCD_WIDTH;
  config.timings.v_res = LCD_HEIGHT;
  config.timings.hsync_pulse_width = 64;
  config.timings.hsync_back_porch = 80;
  config.timings.hsync_front_porch = 42;
  config.timings.vsync_pulse_width = 2;
  config.timings.vsync_back_porch = 74;
  config.timings.vsync_front_porch = 1;
  config.timings.flags.pclk_active_neg = false;
  config.flags.fb_in_psram = true;
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
  config.num_fbs = 1;
  // Параметры стабильного теста №7: 60 строк во внутренних bounce-буферах.
  config.bounce_buffer_size_px = LCD_WIDTH * 60;
#endif

  esp_err_t err = esp_lcd_new_rgb_panel(&config, &panel);
  if (err != ESP_OK) {
    Serial.print(F("[GL050001C0-40] panel allocation failed: "));
    Serial.println(err);
    panel = NULL;
    return false;
  }

  vsyncSemaphore = xSemaphoreCreateBinary();
  if (vsyncSemaphore == NULL) {
    Serial.println(F("[GL050001C0-40] VSYNC semaphore allocation failed"));
    panel = NULL;
    return false;
  }
  esp_lcd_rgb_panel_event_callbacks_t callbacks = {};
  callbacks.on_vsync = onRgbVsync;
  err = esp_lcd_rgb_panel_register_event_callbacks(panel, &callbacks, NULL);
  if (err != ESP_OK) {
    Serial.print(F("[GL050001C0-40] VSYNC callback registration failed: "));
    Serial.println(err);
    panel = NULL;
    return false;
  }

  err = esp_lcd_panel_reset(panel);
  if (err == ESP_OK) {
    err = esp_lcd_panel_init(panel);
  }
  if (err != ESP_OK) {
    Serial.print(F("[GL050001C0-40] panel init failed: "));
    Serial.println(err);
    panel = NULL;
    return false;
  }

  frameBuffer = (uint16_t *)heap_caps_malloc(LCD_WIDTH * LCD_HEIGHT * sizeof(uint16_t),
                                            MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
  if (frameBuffer == NULL) {
    Serial.println(F("[GL050001C0-40] PSRAM framebuffer allocation failed"));
    panel = NULL;
    return false;
  }

  ready = true;
  drawShell();
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
  Serial.println(F("[GL050001C0-40] RGB panel initialized: PCLK 24 MHz, VSYNC 2/74/1, bounce buffer 60 lines"));
#else
  Serial.println(F("[GL050001C0-40] RGB panel initialized: PCLK 24 MHz"));
#endif
  return true;
#endif
}

void GL050001C0_40_showStartup(const String &version)
{
  if (!ready) {
    return;
  }

  startupVersion = version;
  shellDrawn = false;
  drawShell();
  flushFrame();
  startupShownMs = millis();
  operationalFrameShown = false;
  renderedStateValid = false;
}

void GL050001C0_40_showStatus(uint32_t rxPackets, uint32_t txPackets)
{
  displayState.rs485RxPackets = rxPackets;
  displayState.rs485TxPackets = txPackets;
}

void GL050001C0_40_updateState(const GL050001C0_40_State &state)
{
  displayState = state;
  stateAvailable = true;
}

bool GL050001C0_40_needsFrameUpdate()
{
  return ready && stateAvailable;
}
void GL050001C0_40_showPowerOff()
{
  if (!ready) {
    return;
  }

  drawShell();
  flushFrame();
}

void GL050001C0_40_loop()
{
  const uint32_t nowMs = millis();
  if (!ready || !stateAvailable ||
      (uint32_t)(nowMs - startupShownMs) < 3000UL) {
    return;
  }

  if (!operationalFrameShown) {
    if (!Web_displayUpdateAllowed()) {
      return;
    }
    drawOperationalFrame();
    flushFrame();
    renderedState = displayState;
    renderedStateValid = true;
    operationalFrameShown = true;
    lastDisplayUpdateMs = nowMs;
    delay(1);
    return;
  }

  if (!renderedStateValid ||
      (uint32_t)(nowMs - lastDisplayUpdateMs) < DISPLAY_UPDATE_INTERVAL_MS ||
      !Web_displayUpdateAllowed()) {
    return;
  }

  const bool updateTop = topBarChanged(displayState, renderedState);
  const bool updateTable = targetTableChanged(displayState, renderedState);
  const bool updateRadar = radarChanged(displayState, renderedState);
  const bool updateStatus = statusBlocksChanged(displayState, renderedState);
  if (!updateTop && !updateTable && !updateRadar && !updateStatus) {
    return;
  }

  // Сначала готовим только изменившиеся части внешнего кадра в PSRAM.
  // В RGB-панель затем передаются отдельные горизонтальные полосы.
  if (updateTop) {
    fillRect(0, 0, LCD_WIDTH, 38, COLOR_SCREEN_BG);
    drawTopBar();
  }
  if (updateTable) {
    fillRect(0, 38, LCD_WIDTH, 88, COLOR_SCREEN_BG);
    drawTargetTable();
  }
  if (updateRadar) {
    fillRect(0, 126, LCD_WIDTH, LCD_HEIGHT - 126, COLOR_SCREEN_BG);
    drawRadar();
    drawStatusBlocks();
    drawOperationalOverlays();
  } else if (updateStatus) {
    // Нижние блоки расположены поверх шкалы радара: сначала восстанавливаем
    // фон радара, затем заново выводим только телеметрию.
    fillRect(0, 390, LCD_WIDTH, LCD_HEIGHT - 390, COLOR_SCREEN_BG);
    drawRadar();
    drawStatusBlocks();
  }

  if (updateTop) {
    flushBand(0, 38);
  }
  if (updateTable) {
    flushBand(38, 88);
  }
  if (updateRadar) {
    flushBand(126, LCD_HEIGHT - 126);
  } else if (updateStatus) {
    flushBand(390, LCD_HEIGHT - 390);
  }

  renderedState = displayState;
  renderedStateValid = true;
  lastDisplayUpdateMs = nowMs;
  delay(1);
}
